Revit 2026 API

# NurbsSurfaceDataGetControlPoint Method

---

Get the list of control points.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ GetControlPoint(
	int idx
)
```
```vb
Public Function GetControlPoint (
	idx As Integer
) As XYZ
```
```cpp
public:
XYZ^ GetControlPoint(
	int idx
)
```
```fsharp
member GetControlPoint :
        idx : int -> XYZ
```

#### Parameters

idx Int32
     The index of the control point.

#### Return Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentException | Out-of-range access. |

#### Reference

NurbsSurfaceData Class

Autodesk.Revit.DB Namespace